# Percentile

In [23]:
import pandas as pd

In [25]:
df=pd.read_csv('height.csv')

In [26]:
df.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [29]:
df=df.drop(['Weight'], axis=1)

In [30]:
df.head()

  Gender     Height
0   Male  73.847017
1   Male  68.781904
2   Male  74.110105
3   Male  71.730978
4   Male  69.881796

In [31]:
df.describe()

             Height
count  10000.000000
mean      66.367560
std        3.847528
min       54.263133
25%       63.505620
50%       66.318070
75%       69.174262
max       78.998742

In [32]:
max_thresh=df['Height'].quantile(0.95)
min_thresh=df['Height'].quantile(0.05)
print(max_thresh,min_thresh)

72.61710606642383 60.246220826105436

In [33]:
df=df[(df['Height']<max_thresh) & (df['Height']>min_thresh)]

In [34]:
df

      Gender     Height
1       Male  68.781904
3       Male  71.730978
4       Male  69.881796
5       Male  67.253016
6       Male  68.785081
...      ...        ...
9995  Female  66.172652
9996  Female  67.067155
9997  Female  63.867992
9998  Female  69.034243
9999  Female  61.944246

[9000 rows x 2 columns]

# Standard Deviation

In [36]:
import pandas as pd
df=pd.read_csv('height.csv')
df.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [37]:
df=df.drop(['Weight'],axis=1)

In [38]:
df

      Gender     Height
0       Male  73.847017
1       Male  68.781904
2       Male  74.110105
3       Male  71.730978
4       Male  69.881796
...      ...        ...
9995  Female  66.172652
9996  Female  67.067155
9997  Female  63.867992
9998  Female  69.034243
9999  Female  61.944246

[10000 rows x 2 columns]

In [39]:
df.describe()

             Height
count  10000.000000
mean      66.367560
std        3.847528
min       54.263133
25%       63.505620
50%       66.318070
75%       69.174262
max       78.998742

In [40]:
max_thresh=df['Height'].mean()+3*df['Height'].std()
min_thresh=df['Height'].mean()-3*df['Height'].std()

In [41]:
df=df[(df['Height']<max_thresh)&(df['Height']>min_thresh)]

In [43]:
df

      Gender     Height
0       Male  73.847017
1       Male  68.781904
2       Male  74.110105
3       Male  71.730978
4       Male  69.881796
...      ...        ...
9995  Female  66.172652
9996  Female  67.067155
9997  Female  63.867992
9998  Female  69.034243
9999  Female  61.944246

[9993 rows x 2 columns]

# Z Score
Zscore = (datapoint - mean)/std

In [59]:
import pandas as pd
df=pd.read_csv('height.csv')
df.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [60]:
df=df.drop(['Weight'],axis=1)

In [61]:
df

      Gender     Height
0       Male  73.847017
1       Male  68.781904
2       Male  74.110105
3       Male  71.730978
4       Male  69.881796
...      ...        ...
9995  Female  66.172652
9996  Female  67.067155
9997  Female  63.867992
9998  Female  69.034243
9999  Female  61.944246

[10000 rows x 2 columns]

In [47]:
 df.describe()

             Height
count  10000.000000
mean      66.367560
std        3.847528
min       54.263133
25%       63.505620
50%       66.318070
75%       69.174262
max       78.998742

In [48]:
df['zscore']=(df['Height']-df['Height'].mean())/df['Height'].std()

In [50]:
df=df[df['zscore']<=3]

In [51]:
df

      Gender     Height    zscore
0       Male  73.847017  1.943964
1       Male  68.781904  0.627505
2       Male  74.110105  2.012343
3       Male  71.730978  1.393991
4       Male  69.881796  0.913375
...      ...        ...       ...
9995  Female  66.172652 -0.050658
9996  Female  67.067155  0.181830
9997  Female  63.867992 -0.649655
9998  Female  69.034243  0.693090
9999  Female  61.944246 -1.149651

[9995 rows x 3 columns]

In [53]:
df=df.drop(['zscore'],axis=1)

In [54]:
df

      Gender     Height
0       Male  73.847017
1       Male  68.781904
2       Male  74.110105
3       Male  71.730978
4       Male  69.881796
...      ...        ...
9995  Female  66.172652
9996  Female  67.067155
9997  Female  63.867992
9998  Female  69.034243
9999  Female  61.944246

[9995 rows x 2 columns]

# IQR
IQR=Q3-Q1

max=q3+IQR*1.5


min=q1-IQR*1.5

In [62]:
import pandas as pd
df=pd.read_csv('height.csv')
df.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [63]:
df=df.drop(['Weight'],axis=1)

In [64]:
df

      Gender     Height
0       Male  73.847017
1       Male  68.781904
2       Male  74.110105
3       Male  71.730978
4       Male  69.881796
...      ...        ...
9995  Female  66.172652
9996  Female  67.067155
9997  Female  63.867992
9998  Female  69.034243
9999  Female  61.944246

[10000 rows x 2 columns]

In [58]:
IQR=df['Height'].quantile(0.75)-df['Height'].quantile(0.25)

In [65]:
max_thresh=df['Height'].quantile(0.75)+1.5*IQR
min_thresh=df['Height'].quantile(0.25)-1.5*IQR

In [66]:
df=df[(df['Height']<max_thresh)&(df['Height']>min_thresh)]

In [67]:
df

      Gender     Height
0       Male  73.847017
1       Male  68.781904
2       Male  74.110105
3       Male  71.730978
4       Male  69.881796
...      ...        ...
9995  Female  66.172652
9996  Female  67.067155
9997  Female  63.867992
9998  Female  69.034243
9999  Female  61.944246

[9992 rows x 2 columns]